#+PROPERTY: header-args:jupyter :session  ~/jupyter-run/active-ssh.json :pandoc t
#+PROPERTY: header-args:jupyter-python :session ~/jupyter-run/active-ssh.json :pandoc t
#+STARTUP: overview

#+title: Parallelization

We have a parallelization scheme in place that we used to parallelize the computations of analyses.
With multi-population nodes and edges, and to start the support of multiple circuit variants, definitions of subtargets, extraction of neuron properties, and extraction of connectivity should also be parallelized. Here we develop a scheme for parallelization of computations per subtarget.

* Setup :noexport:
In our discussion we will develop scientific concepts to measure the circuit, and implement Python functions to compute them. Here we setup a notebook template to test and explore, and the structure of a ~Python~ package for our methods.

Let us setup an interactive ~Python~ session where we can run the code developed here.

#+begin_src jupyter
from pathlib import Path
print("WelCome to EMACS Jupyter in %s"%(Path.cwd()))
#+end_src

#+RESULTS:
: WelCome to EMACS Jupyter in /gpfs/bbp.cscs.ch/home/sood/work/workspaces

** A notebook template to explore and develop

#+begin_src jupyter-python :tangle develop_parallelization.py :noweb yes :comments no :padline yes
<<notebook-init>>

<<notebook-modules>>

<<notebook-workspaces>>

<<notebook-connsense-tap>>

<<notebook-connsense-topotap>>
#+end_src

#+RESULTS:
:  2023-02-21 17:41:14,304: Configure slurm for define-subtargets
:  2023-02-21 17:41:14,304: Configure slurm for create-index
:  2023-02-21 17:41:14,305: No runtime configured for computation type create-index
:  2023-02-21 17:41:14,305: Configure slurm for extract-node-populations
:  2023-02-21 17:41:14,306: Configure slurm for extract-edge-populations
:  2023-02-21 17:41:14,306: Configure slurm for analyze-connectivity
: We will plot golden aspect ratios:  1.618033988749895
: Available analyses:
: Available analyses:
: {'connectivity': {'simplex-counts': <connsense.develop.topotap.TapDataset object at 0x7fff1929d0d0>}}

** Test develop

Let us test develop computation of simplex-counts,

#+begin_src jupyter-python :tangle develop_parallelization.py
computation = "analyze-connectivity/simplex-counts"
print("Let test develop computation of")
pprint(prl.describe(computation))

params = prl.parameterize(*prl.describe(computation), topaz._config)
print("Using parameters")
pprint(params)
#+end_src

#+RESULTS:
#+begin_example
Let test develop computation of
('analyze-connectivity', 'simplex-counts')
Using parameters
{'computation': {'method': 'simplex_counts',
                 'source': '/gpfs/bbp.cscs.ch/project/proj83/analyses/topological-analysis-subvolumes/proj83/connectome_analysis/library/topology.py'},
 'description': 'Number of simplices by dimension.',
 'index': {'circuit': ['Bio_M'],
           'connectome': ['local'],
           'subtarget': {'dataset': ['define-subtargets', 'flatmap-columns']}},
 'input': {'adjacency': {'dataset': ['extract-edge-populations', 'local']}},
 'output': 'pandas.Series'}
#+end_example

*** Test develop

We have setup a workspace to compute simplex-counts, with a config based on our discussion. Let us see what inputs we can load for ~simplex-count~ analysis.
#+begin_src jupyter-python :tangle develop_parallelization.py
computation = "analyze-connectivity/simplex-counts"
params = devprl.parameterize(*devprl.describe(computation), topaz._config)

print("inputs for simplex-counts:\n")
pprint({k: v for k, v in params["input"].items() if k not in ("transformations", "slicing")})

print("\nwith transformations\n")
pprint(params["input"]["transformations"])
#+end_src

We can pass these ~config~ to ~connsense-TAP~ to generate the inputs,
#+begin_src jupyter-python :tangle develop_parallelization.py
inputs = devprl.generate_inputs(computation, topaz._config)

display(inputs)
#+end_src


The inputs have 11 times the number of ~flatmap-column~s, 1 for the original, 5 per original for ~erodos-renyi~ and ~dd2-model~ each,
#+begin_src jupyter-python :tangle develop_parallelization.py
subtargets_per_control = inputs.groupby("control").size()
display(subtargets_per_control)
#+end_src

#+RESULTS:
#+begin_example
control
dd2-0            239
dd2-1            239
dd2-2            239
dd2-3            239
dd2-4            239
erdos-renyi-0    239
erdos-renyi-1    239
erdos-renyi-2    239
erdos-renyi-3    239
erdos-renyi-4    239
original         239
dtype: int64
#+end_example

Each entry amont ~inputs~ contains a ~datacall~ that will return the configured inputs, in the case of ~simplex-counts~ a ~mapping~ that provides values for ~adjacency~ and ~node_properties~ that the configured computation method expects,
#+begin_src jupyter-python :tangle develop_parallelization.py
input_quantities_0 = inputs.iloc[0]()
for variable, value in input_quantities_0.items():
    print("input %s: \n%s"%(variable, type(value)))
#+end_src

#+RESULTS:
: input adjacency:
: <class 'scipy.sparse.csr.csr_matrix'>
: input node_properties:
: <class 'pandas.core.frame.DataFrame'>

